별회 = "#fUI/GuildMark.img/Mark/Pattern/00004001/15#"

var status = 0;

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (mode == 0) {
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;;

    if (status == 0) {
        cm.sendOkS("#fn나눔고딕 Extrabold##fs12#이 빛나는 비석에는 조그마한 글씨로 이렇게 적혀있다…\r\n#L100##r[바로가기]#k #b퀘스트의 전당 바로 이동하기#k#l\r\n\r\n-------------------------------------------------------------------------------\r\n\r\n                            #d< 퀘스트 클리어 보상 안내 >#k\r\n\r\n-------------------------------------------------------------------------------\r\n\r\n#fs14#"+별회+" 교장 이바나 - 엘리넬 학원 일손돕기 #r(LV.200 이하)#k\r\n\r\n#fs12#[#r보상#k] #i1142681# #b#z1142681##k #d올스탯, 공, 마 200#k [1 회 제한]\r\n[#r보상#k] #i4310175# #bM 코인#k #d30 개#k [1 회 제한]\r\n[#r보상#k] #i4310175# #bM 코인#k #d5 개#k [1 회 이상]\r\n\r\n-------------------------------------------------------------------------------\r\n\r\n#fs14#"+별회+" 점프하는 주황 버섯 - 주황 버섯 돕기 #r(LV.160 이상)#k\r\n\r\n#fs12#[#r보상#k] #i1112750# #b#z1112750##k #d올스탯 400 / 공, 마 100#k [1 회 제한]\r\n[#r보상#k] #i4310175# #bM 코인#k #d30 개#k [1 회 제한]\r\n[#r보상#k] #i4310175# #bM 코인#k #d10 개#k [1 회 이상]\r\n[#r보상#k] #i4310175# #bM 코인#k #d각 1 개 X 4#k [부분 완료 획득]\r\n\r\n-------------------------------------------------------------------------------\r\n\r\n#fs14#"+별회+" 키샤 - 도서관장 탈레스의 고민 #r(LV.160 이상)#k\r\n\r\n#fs12#[#r보상#k] #i1122017# #b#z1122017##k #d2 일권#k [1 회 제한]\r\n[#r보상#k] #i4080000# #b#z4080000##k #d미니게임#k [1 회 제한]\r\n[#r보상#k] #i4080100# #b#z4080100##k #d미니게임#k [1 회 제한]\r\n[#r보상#k] #i4310175# #bM 코인#k #d40 개#k [1 회 제한]\r\n[#r보상#k] #i4310175# #bM 코인#k #d20 개#k [1 회 이상]\r\n\r\n-------------------------------------------------------------------------------\r\n\r\n#fs14#"+별회+" 쁘띠자쿰 - 자쿰 토벌대 #r(LV.160 이상)#k\r\n\r\n#fs12#[#r보상#k] #i1004637# #b#z1004637##k [선택제]\r\n                        #d올스탯 500 / 공, 마 100 / 업횟 8#k\r\n[#r보상#k] #i1102871# #b#z1102871##k [선택제]\r\n                        #d올스탯 500 / 공, 마 100 / 업횟 6#k\r\n[#r보상#k] #i1082447# #b#z1082447##k [선택제]\r\n                        #d올스탯 500 / 공, 마 100 / 업횟 4#k\r\n[#r보상#k] #i1132296# #b#z1132296##k [선택제]\r\n                        #d올스탯 500 / 공, 마 100 / 업횟 2#k\r\n[#r보상#k] #i4310175# #bM 코인#k #d10 개#k [일괄 지급]\r\n\r\n-------------------------------------------------------------------------------\r\n\r\n#fs14#"+별회+" 라비 - 체험! 탐사 현장 #r(LV.180 이상)#k\r\n\r\n#fs12#[#r보상#k] #i1122058# #b혼돈 목걸이#k #d올스탯 250 / 공, 마 250#k [1 회 제한]\r\n[#r보상#k] #i4310175# #bM 코인#k #d30 개#k [1 회 제한]\r\n[#r보상#k] #i4310175# #bM 코인#k #d10 개#k [1 회 이상]\r\n\r\n-------------------------------------------------------------------------------\r\n\r\n#fs14#"+별회+" 따치 - 친구 따보의 도둑 수색 작전 #r(LV.180 이상)#k\r\n\r\n#fs12#[#r보상#k] #i2046856# #b악세서리 공격력 100 %#k #d주문서#k [랜덤 획득]\r\n[#r보상#k] #i2046857# #b악세서리 마력력 100 %#k #d주문서#k [랜덤 획득]\r\n[#r보상#k] #i4310175# #bM 코인#k #d5 개#k [일괄 지급]\r\n\r\n-------------------------------------------------------------------------------\r\n\r\n#fs14#"+별회+" 제니 - 도전! 핀볼 #r(1 일 계정 당 6 회 제한)#k#fs12#\r\n\r\n[#r보상#k] #i4310175# #bM 코인#k #d0 ~ 10 개#k [1 일 6 회 제한]\r\n\r\n-------------------------------------------------------------------------------\r\n\r\n#fs14#"+별회+" 동화요정 피키 - 다이어트 테스트 #r(자유 수행)#k\r\n\r\n#fs12#[#r보상#k] #i2048094# #b펫 장비 공격력 100 %#k #d주문서#k [선택제]\r\n[#r보상#k] #i2048095# #b펫 장비 마력 100 %#k #d주문서#k [선택제]\r\n\r\n-------------------------------------------------------------------------------\r\n\r\n#fs14#"+별회+" 달풍이 - 나의 한계 돌파 프로젝트 #r(자유 수행)#k\r\n\r\n#fs12#[#r보상#k] #i1190300# #b실버 엠블렘#k #d올스탯 300 / 공, 마 20#k [선택제]\r\n[#r보상#k] #i1190301# #b골드 엠블렘#k #d올스탯 400 / 공, 마 40#k [선택제]\r\n[#r보상#k] #i1190302# #b크리스탈 엠블렘#k #d올스탯 500 / 공, 마 60#k [선택제]\r\n\r\n-------------------------------------------------------------------------------",2);
  } else if (status == 1) {
if (selection == 100) {
        cm.dispose();
        cm.warp(100030301);

}
}
}
}