var status = -1;
    

// 건들이시면 안됩니다.
lineUseArray = [];
Howmany = 5; //

coincode = 4310198;
coinqty = 30;

앙 = null;


function start() {
    status = -1;
    action (1, 0, null);
}

function action(mode, type, selection) {
    ItemArray = [1701000, 1702051, 1702052, 1702053, 1702054, 1702071, 1702075, 1702076, 1702077, 1702089, 1702094, 1702095, 1702097, 1702101, 1702102, 1702104, 1702105, 1702113, 1702116, 1702117, 1702126, 1702128, 1702129, 1702130, 1702131, 1702132, 1702135, 1702138, 1702139, 1702140, 1702143, 1702148, 1702152, 1702153, 1702156, 1702157, 1702161, 1702163, 1702164, 1702171, 1702172, 1702175, 1702178, 1702183, 1702184, 1702185, 1702186, 1702187, 1702189, 1702193, 1702197, 1702198, 1702200, 1702201, 1702204, 1702208, 1702209, 1702210, 1702213, 1702214, 1702215, 1702218, 1702219, 1702220, 1702222, 1702223, 1702224, 1702226, 1702228, 1702229, 1702230, 1702231, 1702232, 1702234, 1702235, 1702236, 1702237, 1702239, 1702240, 1702246, 1702249, 1702250, 1702251, 1702252, 1702256, 1702257, 1702258, 1702259, 1702260, 1702261, 1702262, 1702263, 1702264, 1702266, 1702268, 1702274, 1702276, 1702278, 1702279, 1702280, 1702281, 1702282, 1702283, 1702284, 1702285, 1702286, 1702295, 1702296, 1702301, 1702302, 1702303, 1702305, 1702310, 1702311, 1702324, 1702333, 1702335, 1702341, 1702344, 1702345, 1702346, 1702351, 1702355, 1702356, 1702358, 1702359, 1702360, 1702371, 1702372, 1702374, 1702376, 1702379, 1702380, 1702381, 1702392, 1702393, 1702401, 1702402, 1702403, 1702404, 1702407, 1702408, 1702409, 1702417, 1702459, 1702460, 1702462, 1702472, 1702474, 1702475, 1702479, 1702489, 1702491, 1702492, 1702499, 1702506, 1702507, 1702509, 1702510, 1702522, 1702526, 1702556, 1702557, 1702559, 1702560, 1702566, 1702567, 1702572, 1702579, 1702583, 1702585, 1702588, 1702589, 1702600, 1702601, 1702602, 1702603, 1702604, 1702605, 1702606, 1702611, 1702626, 1702630, 1702633, 1702635, 1702640, 1702660, 1702671, 1702675, 1702682, 1702684, 1702685, 1702686, 1702692, 1702693, 1702697, 1702698, 1702699, 1702700, 1702710, 1702711, 1702712, 1702713, 1702714, 1702719, 1702722, 1702727, 1702733, 1702740, 1702742, 1702748, 1702750, 1702752, 1702753, 1702758, 1702764, 1702765, 1702773, 1702776, 1702777, 1702778, 1702783, 1702784, 1702785]
    if (mode == -1) {
        cm.dispose();
        return;
    }
    if (mode == 0) {
        status --;
    }
    if (mode == 1) {
        status++;
      if (status == 0) {
        앙 = selection;
        if (앙 != null) {
           for (i=0; i<ItemArray.length; i++) {
            말+= "#L"+i+"# #i"+ItemArray[i]+"#"
            if (lineUseArray.some(function(ok,index,lineUseArray) {
                 return ok == 앙;
                  }) == false) { 
           lineUseArray.push(앙);
            }
          }
        }
      }
    }    
    if (status == 0) {
       if (lineUseArray.length != Howmany) {
        말 = "#fn나눔고딕 Extrabold# 골라요! 골라! #b떡국코인30개#k로 자신이 #b원하는 아이템#k만 넣어 그 중 #b한가지#k를 얻을 수 있는 절호의 기회! 이 #b멋진 기회#k를 놓치진 않겠죠?\r\n\r\n"
        말+= "#r선택한 아이템 개수#k : "+lineUseArray.length+"\r\n"
        말+= "#r남은 선택 회수#k : "+(Howmany-lineUseArray.length)+"\r\n";
        for (i=0; i<ItemArray.length; i++) {
            말+= "#L"+i+"# #i"+ItemArray[i]+"#"
            if (lineUseArray.some(function(ok,index,lineUseArray) {
                 return ok == i;
                  }) == true) { 
                말+="#b#e#z"+ItemArray[i]+"##n#k\r\n"
            } else {
                말+="#z"+ItemArray[i]+"#\r\n";
            }
        }
        cm.sendSimple(말);
        status --;
       } else {
          말 = "현재 선택된 리스트의 아이템을 넣고 뽑기를 시작하시겠습니까?\r\n\r\n"
          for (i=0; i<lineUseArray.length; i++) {
             말+= "#i"+ItemArray[lineUseArray[i]]+"# #b#e#z"+ItemArray[lineUseArray[i]]+"##k#n\r\n";
          }
          cm.sendYesNo(말)
       }
      } else if (status == 1) {
         if (cm.itemQuantity(coincode) >= coinqty) {
          랜덤 = ItemArray[lineUseArray[Math.floor(Math.random() * lineUseArray.length)]]
          cm.gainItem(랜덤,1);
          cm.gainItem(coincode,-coinqty)
          cm.sendOk("어머어머! 좋은 아이템도 나오셨네요!\r\n\r\n#i"+랜덤+"# #b#z"+랜덤+"##k");
        } else {
          cm.sendOk("코인이 부족합니다.")
        }
          cm.dispose();
    }
}
