var status = -1;
    

// 건들이시면 안됩니다.
lineUseArray = [];
Howmany = 5; //

coincode = 4310198;
coinqty = 30;

앙 = null;


function start() {
    status = -1;
    action (1, 0, null);
}

function action(mode, type, selection) {
    ItemArray = [1070007, 1070008, 1070014, 1070015, 1070018, 1070031, 1070068, 1070075, 1071019, 1071024, 1071025, 1071048, 1071084, 1071092, 1072254, 1072255, 1072270, 1072271, 1072277, 1072348, 1072374, 1072380, 1072385, 1072386, 1072387, 1072388, 1072389, 1072392, 1072393, 1072396, 1072397, 1072398, 1072404, 1072405, 1072406, 1072408, 1072410, 1072417, 1072437, 1072439, 1072440, 1072456, 1072464, 1072465, 1072466, 1072467, 1072468, 1072469, 1072470, 1072482, 1072495, 1072507, 1072509, 1072517, 1072520, 1072532, 1072536, 1072537, 1072609, 1072627, 1072628, 1072631, 1072637, 1072647, 1072648, 1072649, 1072650, 1072651, 1072652, 1072658, 1072662, 1072676, 1072680, 1072681, 1072708, 1072729, 1072749, 1072750, 1072770, 1072771, 1072772, 1072773, 1072779, 1072780, 1072781, 1072791, 1072800, 1072807, 1072812, 1072813, 1072820, 1072839, 1072840, 1072848, 1072854, 1072855, 1072863, 1072864, 1072865, 1072869, 1072873, 1072875, 1072878, 1072879, 1072880, 1072881, 1072883, 1072884, 1072909, 1072910, 1072913, 1072916, 1072917, 1072918, 1072919, 1072920, 1072921, 1072922, 1072923, 1072924, 1072925, 1072926, 1072942, 1072944, 1072945, 1072949, 1072950, 1072979, 1072980, 1072999, 1073009, 1073014, 1073022, 1073024, 1073027, 1073036, 1073038, 1073040, 1073046, 1073047, 1073051, 1073052, 1073055, 1073060, 1073061, 1073062, 1073074, 1073080, 1073096, 1073106, 1073107, 1073108, 1073129, 1073132, 1073133, 1073134, 1073135, 1073145, 1073150, 1073153, 1073154, 1073155, 1073157, 1073167, 1073168, 1073169, 1073177, 1073178, 1073179, 1073180, 1073181, 1073182, 1073185, 1073188, 1073189, 1073192, 1073195, 1073196, 1073203, 1073204, 1073205, 1073215, 1073216, 1073217, 1073222, 1073223, 1073228, 1073229, 1073230]
    if (mode == -1) {
        cm.dispose();
        return;
    }
    if (mode == 0) {
        status --;
    }
    if (mode == 1) {
        status++;
      if (status == 0) {
        앙 = selection;
        if (앙 != null) {
           for (i=0; i<ItemArray.length; i++) {
            말+= "#L"+i+"# #i"+ItemArray[i]+"#"
            if (lineUseArray.some(function(ok,index,lineUseArray) {
                 return ok == 앙;
                  }) == false) { 
           lineUseArray.push(앙);
            }
          }
        }
      }
    }    
    if (status == 0) {
       if (lineUseArray.length != Howmany) {
        말 = "#fn나눔고딕 Extrabold# 골라요! 골라! #b떡국코인30개#k로 자신이 #b원하는 아이템#k만 넣어 그 중 #b한가지#k를 얻을 수 있는 절호의 기회! 이 #b멋진 기회#k를 놓치진 않겠죠?\r\n\r\n"
        말+= "#r선택한 아이템 개수#k : "+lineUseArray.length+"\r\n"
        말+= "#r남은 선택 회수#k : "+(Howmany-lineUseArray.length)+"\r\n";
        for (i=0; i<ItemArray.length; i++) {
            말+= "#L"+i+"# #i"+ItemArray[i]+"#"
            if (lineUseArray.some(function(ok,index,lineUseArray) {
                 return ok == i;
                  }) == true) { 
                말+="#b#e#z"+ItemArray[i]+"##n#k\r\n"
            } else {
                말+="#z"+ItemArray[i]+"#\r\n";
            }
        }
        cm.sendSimple(말);
        status --;
       } else {
          말 = "현재 선택된 리스트의 아이템을 넣고 뽑기를 시작하시겠습니까?\r\n\r\n"
          for (i=0; i<lineUseArray.length; i++) {
             말+= "#i"+ItemArray[lineUseArray[i]]+"# #b#e#z"+ItemArray[lineUseArray[i]]+"##k#n\r\n";
          }
          cm.sendYesNo(말)
       }
      } else if (status == 1) {
         if (cm.itemQuantity(coincode) >= coinqty) {
          랜덤 = ItemArray[lineUseArray[Math.floor(Math.random() * lineUseArray.length)]]
          cm.gainItem(랜덤,1);
          cm.gainItem(coincode,-coinqty)
          cm.sendOk("어머어머! 좋은 아이템도 나오셨네요!\r\n\r\n#i"+랜덤+"# #b#z"+랜덤+"##k");
        } else {
          cm.sendOk("코인이 부족합니다.")
        }
          cm.dispose();
    }
}
