/*
 
  최성우
  sqlstyle...

*/

importPackage(java.lang);
importPackage(Packages.handling.world);
importPackage(Packages.packet.creators);

var status = 0;
var beauty = 0;
var facenew;
var colors;
var hairnew;
var haircolor;
var skin = Array(0, 1, 2, 3, 4, 9, 10, 11, 12, 13);
var mface = Array(20000,20001,20002,20003,20004,20005,20006,20007,20008,20009,20010,20011,20012,20013,20014,20015,20016,20017,20018,20019,20020,20021,20022,20024,20025,20027,20028,20029,20030,20031,20032,20036,20037,20040,20043,20044,20045,20046,20047,20048,20049,20050,20053,20055,20056,20057,20058,20059,20060,20061,20062,20063,20064,20065,20066,20067,20068,20069);
var mhair = Array(30000,30020,30030,30040,30050,30060,30100,30110,30120,30130,30140,30150,30160,30170,30180,30190,30200,30210,30220,30230,30240,30250,30260,30270,30280,30290,30300,30310,30320,30330,30340,30350,30360,30370,30400,30410,30420,30440,30450,30460,30470,30480,30490,30510,30520,30530,30540,30560,30570,30590,30610,30620,30630,30640,30650,30660,30670,30680,30700,30710,30730,30760,30770,30790,30800,30810,30820,30830,30840,30850,30860,30870,30880,30910,30930,30940,30950,33030,33060,33070,33080,33090,33110,33120,33130,33150,33170,33180,33190,33210,33220,33250,33260,33270,33280,33310,33330,33350,33360,33370,33380,33390,33400,33410,33430,33440,33450,33460,33480,33500,33510,33520,33530,33550,33580,33590,33600,33610,33620,33630,33640,33660,33670,33680,33690,33700,33710,33720,33730,33740,33750,33760,33770,33780,33790,33800,33810,33820,33830,33930,33940,33950,33960);
var fface = Array(21000,21001,21002,21003,21004,21005,21006,21007,21008,21009,21010,21011,21012,21013,21014,21015,21016,21017,21018,21019,21020,21021,21023,21024,21026,21027,21028,21029,21030,21031,21033,21035,21036,21038,21041,21042,21043,21044,21045,21046,21047,21048,21052,21053,21054,21055,21056,21057,21058,21059,21060,21061,21062,21063,21064);
var fhair = Array(31000,31010,31020,31030,31040,31050,31060,31070,31080,31090,31100,31110,31120,31130,31140,31150,31160,31170,31180,31190,31200,31210,31220,31230,31240,31250,31260,31270,31280,31290,31300,31310,31320,31330,31340,31350,31400,31410,31420,31440,31450,31460,31470,31480,31490,31510,31520,31530,31540,31550,31560,31590,31610,31620,31630,31640,31650,31670,31680,31690,31700,31710,31720,31740,31750,31780,31790,31800,31810,31820,31840,31850,31860,31880,31890,31910,31920,31930,31940,31950,31990,34040,34070,34080,34090,34100,34110,34120,34130,34140,34150,34160,34170,34180,34190,34210,34220,34230,34240,34250,34260,34270,34310,34320,34330,34340,34360,34370,34380,34400,34410,34420,34430,34440,34450,34470,34480,34490,34510,34540,34560,34590,34600,34610,34620,34630,34640,34660,34670,34680,34690,34700,34710,34720,34730,34740,34750,34760,34770,34780,34790,34800,34810,34820,34830,34840,34850,34860,34870);
var select = -1;
function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (mode == 0) {
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;
        if (status == 0) {
            var chat= "#fn나눔고딕 EXtrabold#  안녕하세요. 저는 #bAURORA ONLINE#k에서 펫상점을 관리중인 오르카 입니다.\r\n\r\n";
	    chat += "#L0##r#e[Guide]#k#d펫 사용법#k을 알고싶습니다.\r\n";
	    chat += "#L1##r#e[HOT]#k#d펫 상점#k 을 이용하겠습니다.\r\n";
	    chat += "#L7##r#e[HOT]#k#d펫 검색#k 을 이용하겠습니다.\r\n";
	    chat += "#L6##r#e[HOT]#k#d펫 관련 용품상점#k 을 이용하겠습니다.\r\n";
	    chat += "#L2##r#e[HOT]#k#d펫 스킬 상점#k 을 이용하겠습니다.\r\n";
	    cm.sendSimple(chat);

	      }  else if (selection == 0) {
                var abc1 = "#r#e#fn나눔고딕 EXtrabold# 펫 사용법을 모르시는분들을 위한 설명서#n#k\r\n\r\n";
                abc1 += "#L3#펫 아이템줍기 설명\r\n";
	        abc1 += "#L4#펫 자동물약 먹기 설명\r\n";
	        abc1 += "#L5#펫 자동버프 설명\r\n";
		cm.sendSimple(abc1);
	      }  else if (selection == 3) {
                var a1 = "#r#e1.첫번째강의 펫 아이템과 메소줍기 적용#n#k\r\n";
                a1 += "\r\n#r1.#k#b펫과 펫스킬을 구입하십니다.#k\r\n#r2.#k#b펫을 장착하신후 밑에있는순서대로 스킬을 적용해주세요.#k\r\n #r첫째#k로 #i5190000##r아이템 줍기 스킬#k#b을 원하는 펫에 적용해준다.#k\r\n#r둘째#k로#i5190003##r자동 줍기 스킬#k#b을 원하는 펫에 적용해준다.#k\r\n#r마지막으로#k#bE키를 누르시고 펫쪽을 선택해주시고 아이템 자동줍기를 체크해주세요. 그러시면 펫이 아이템과 메소를 줍습니다.#k\r\n";
		cm.sendSimple(a1);
	      }  else if (selection == 4) {
                var a2 = "#r#e2.두전째강의HP물약과 MP물약 펫이 자동으로 채워주기#k#n\r\n";
                a2 += "#b1.펫 스킬 상점에서 HP 물약 충전과MP 물약 충전스킬을 구입합니다.#k\r\n#b2.스킬을 원하시는펫에 적용해주세요.#k\r\n#b3.펫스킬을 적용하셧으면 E키를 누르시고 펫창으로 가셔서 #rPOTION SETING#k#b공간이 있습니다. #rPET HP에는 HP물약을#rPET MP에는 MP물약을#k#b 올려주세요.#k\r\n#b4.펫이 물약을 안먹는다. 그건 #rESC키#k#b를 누르시고 옵션을 가시고 #rHP경고표시와MP경고표시#k#b가 있습니다. 자신의 피가 어느정도 깍일경우 펫이 물약을 자동으로 먹게 해주는걸 설정해줍니다.#k";
		cm.sendSimple(a2);
	      }  else if (selection == 5) {
                var a3 = "#r#e3.세번째강의 펫 자동버프#k#n\r\n";
                a3 += "#b1.펫 스킬 상점에서 버프자동 스킬을 구입합니다.#k\r\n#b2.스킬을 원하시는펫에 적용해주세요.#k\r\n#b3.펫스킬을 적용하셧으면 E키를 누르시고 펫창으로 가셔서 #rPET ACCk#b공간이 있습니다. #r3개의 칸이 있는데요. 각칸마다 원하는 스킬을 올려주세요.#k";
		cm.sendSimple(a3);
	      }  else if (selection == 1) {
 	        cm.dispose();
		cm.openNpc(1040001);
              }  else if (selection == 2) {
		cm.dispose();
		cm.openShop(2134003); // 펫스킬
	      }  else if (selection == 6) {
 	        cm.dispose();
		cm.openNpc(1012004);
              }  else if (selection == 7) {
 	        cm.dispose();
		cm.openNpc(2210010);
}
}
}