/* 화이트매니저의 스크립트 */

importPackage(java.lang);
importPackage(Packages.handling.world);
importPackage(Packages.packet.creators);

var items = new Array(1492100, 1452158, 1462115, 1382123, 1492236, 1462999, 1462238, 1452102, 1362142, 1362143, 1362144, 1362125, 1362127, 1362129, 1452103, 1452104, 1452105, 1402080, 1402079, 1402078, 1402089, 1402088, 1472139, 1412056, 1402087, 1402090, 1402029, 1402071, 1492100, 1492099, 1452157, 1332146, 1332147, 1482130, 1442996, 1442995, 1362141, 1452106, 1702298, 1442999, 1442998, 1442997, 1442299, 1442298, 1442297, 1442267, 1442266, 1442201, 1303005, 1303006, 1332300, 1382199, 1442200, 1442191, 1442192, 1442193, 1442194, 1442195, 1442196, 1442197, 1442198, 1442199, 1710000, 1710001, 1303002, 1303001, 1303000, 1302998, 1302997, 1302996, 1302995, 1302994, 1302999, 1703999, 1703996, 1703997, 1382264, 1442202, 1442203, 1442269, 1004010, 1004011, 1004015, 1004017, 1004018, 1004021, 1004023, 1004025, 1004030, 1004041, 1004044, 1004045, 1004046, 1004047, 1004049, 1004901, 1004902, 1004903, 1004904, 1004905, 1302061, 1004906, 1004907, 1004908, 1004909, 1004910, 1004911, 1004900);

var ran = Math.floor(Math.random() * 100) +1;

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (mode == 0) {
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;
        if (status == 0) {
                var chat= "#e#r#h #님#n#k의 현재 후원포인트 : #e#r"+cm.getRC()+"#n#k\r\n#e#b안녕하세요. #h #님 대박 뽑기 진행 중 입니다.#k\r\n#e#d[올스텟 4000 공/마 1000]#k#n\r\n#e#r[대박 뽑기]#k 등장 아이템 : #i1492100#, #i1452158#, #i1462115#, #i1382123#, #i1492236#, #i1462999#, #i1462238#, #i1452102#, #i1362142#, #i1362143#, #i1362144#, #i1362125#, #i1362127#, #i1362129#, #i1452103#, #i1452104#, #i1452105#, #i1402080#, #i1402079#, #i1402078#, #i1402089#, #i1402088#, #i1472139#, #i1412056#, #i1402087#, #i1402090#, #i1402029#, #i1402071#, #i1492100#, #i1492099#, #i1452157#, #i1332146#, #i1332147#, #i1482130#, #i1442996#, #i1442995#, #i1362141#, #i1452106#, #i1702298#, #i1442999#, #i1442998#, #i1442997#, #i1442299#, #i1442298#, #i1442297#, #i1442267#, #i1442266#, #i1442201#, #i1303005#, #i1303006#, #i1332300#, #i1382199#, #i1442200#, #i1442191#, #i1442192#, #i1442193#, #i1442194#, #i1442195#, #i1442196#, #i1442197#, #i1442198#, #i1442199#, #i1710000#, #i1710001#, #i1303002#, #i1303001#, #i1303000#, #i1302998#, #i1302996#, #i1302995#, #i1302994#, #i1302999#, #i1703999#, #i1703996#, #i1703997#, #i1382264#, #i1442202#, #i1442203#, #i1004010#, #i1302997# #i1004011#, #i1004015#, #i1004017#, #i1004018#, #i1004021#, #i1004023#, #i1004025#, #i1004030#, #i1004041#, #i1004044#, #i1004045#, #i1004046#, #i1004047#, #i1004049#, #i1004901#, #i1004902#, #i1004903#, #i1004904#, #i1004905#, #i1302061#, #i1004906#, #i1004907#, #i1004908#, #i1004909#, #i1004910#, #i1004911#, #i1004900# \r\n\r\n#e#b대박 아이템#k들을 저격 해보세요 !!#fUI/UIWindow2.img/UtilDlgEx/list4#\r\n";
	    chat += "#L0##b대박 뽑기를 하겠습니다. (100000 후원포인트 소모)#k#n\r\n#l";
	    cm.sendSimple(chat);
	} else if (selection == 0) {
	if (cm.getPlayer().getRC() >= 100000) {
			cm.sendOk("#fn나눔고딕 Extrabold##fs13##r대박 뽑기#k 아이템이 지급되셨습니다.");
			makeSponserItem(items[Math.floor(Math.random() * items.length)], 4000,1000,0);
                	cm.getPlayer().loseRC(100000);
                	cm.dispose();
	} else {
		cm.sendOk("후원포인트가 부족합니다.");
		cm.dispose();
	}
        }
    }
}
    
        function makeSponserItem(itemid,allstat,atk) {
	var ii = Packages.server.items.ItemInformation.getInstance();
	var item = ii.getEquipById(itemid);
	item.setStr(allstat);
	item.setDex(allstat);
	item.setInt(allstat);
	item.setLuk(allstat);
	item.setWatk(atk);
	item.setMatk(atk);
	
	item.setOwner("[대박뽑기]");
	Packages.server.items.InventoryManipulator.addFromDrop(cm.getC(),item,false);
}
    

